Rails/customers-api/app/controllers/api/v1/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("first_name", "last_name", "age", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Dominick"], ["last_name", "Ryan"], ["age", 31], ["phone_number", 860], ["created_at", "2021-07-01 22:45:03.412883"], ["updated_at", "2021-07-01 22:45:03.412883"]]

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 33]]