Rails/customers-api/app/controllers/api/v1/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def create
    @order = Order.create(order_params)
---
INSERT INTO "orders" ("customer_id", "item_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["customer_id", 6], ["item_name", "\u{A4D9A}􈩒b "], ["created_at", "2021-07-02 03:34:56.750697"], ["updated_at", "2021-07-02 03:34:56.750697"]]

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 28]]